{
  "jobs": [
    {
      "id": "1",
      "title": "Senior React Developer",
      "type": "Full-Time",
      "description": "We are seeking a talented Senior React Developer to join our team in Dhaka, Bangladesh. The ideal candidate will have strong skills in HTML, CSS, and JavaScript, with experience working with React or other modern JavaScript frameworks.",
      "location": "Dhaka, Bangladesh",
      "salary": "BDT 1,200,000 - BDT 1,500,000",
      "company": {
        "name": "Tech Innovators BD",
        "description": "Tech Innovators BD is a leading technology company specializing in web development and digital solutions. We deliver high-quality products and services to clients across various industries while fostering a collaborative work environment.",
        "contactEmail": "careers@techinnovatorsbd.com",
        "contactPhone": "+880-2-123456789"
      }
    },
    {
      "id": "2",
      "title": "Front-End Engineer (React & Redux)",
      "type": "Full-Time",
      "location": "Bangalore, India",
      "description": "Join our team as a Front-End Developer in the tech hub of Bangalore, India. We are looking for a motivated individual with a passion for crafting responsive and scalable web applications using React and Redux.",
      "salary": "INR 900,000 - INR 1,100,000",
      "company": {
        "name": "PixelCraft Technologies",
        "description": "PixelCraft Technologies is a tech agency that specializes in full-stack development and interactive design, providing innovative solutions for clients worldwide.",
        "contactEmail": "jobs@pixelcrafttechnologies.com",
        "contactPhone": "+91-80-23456789"
      }
    },
    {
      "id": "3",
      "title": "React.js Developer",
      "type": "Full-Time",
      "location": "Kolkata, India",
      "description": "We're hiring a React.js Developer for our team in Kolkata, India. The ideal candidate will have a strong understanding of modern JavaScript and React.js to build high-performance applications.",
      "salary": "INR 700,000 - INR 900,000",
      "company": {
        "name": "Innovate Web Solutions India",
        "description": "Innovate Web Solutions India is a growing web development company that specializes in building scalable web applications for global businesses.",
        "contactEmail": "careers@innovatewebsolutions.in",
        "contactPhone": "+91-33-87654321"
      }
    },
    {
      "id": "4",
      "title": "React Front-End Developer",
      "type": "Part-Time",
      "description": "Looking for a Part-Time React Front-End Developer in Pune, India. This role offers flexibility and remote work opportunities for a self-motivated individual skilled in modern React frameworks.",
      "location": "Pune, India",
      "salary": "INR 400,000 - INR 500,000",
      "company": {
        "name": "NextGen Digital Solutions",
        "description": "NextGen Digital Solutions is a creative agency focused on delivering cutting-edge digital marketing and development services to clients around the globe.",
        "contactEmail": "hr@nextgendigitalsolutions.com",
        "contactPhone": "+91-20-98765432"
      }
    },
    {
      "id": "5",
      "title": "Full Stack React Developer",
      "type": "Full-Time",
      "description": "We are looking for a Full Stack React Developer to join our growing team in Mumbai, India. This role involves working on both the front-end and back-end of web applications with React, Node.js, and MongoDB.",
      "location": "Mumbai, India",
      "salary": "INR 1,200,000 - INR 1,500,000",
      "company": {
        "name": "EvolvTech Solutions",
        "description": "EvolvTech Solutions is a leading tech company providing web-based solutions for industries such as finance, healthcare, and e-commerce.",
        "contactEmail": "careers@evolvtechsolutions.com",
        "contactPhone": "+91-22-12345678"
      }
    },
    {
      "id": "6",
      "title": "React Native Developer",
      "type": "Full-Time",
      "description": "Join our team as a React Native Developer in Chittagong, Bangladesh. You will work on building mobile applications using React Native for both iOS and Android platforms.",
      "location": "Chittagong, Bangladesh",
      "salary": "BDT 1,000,000 - BDT 1,300,000",
      "company": {
        "name": "Mobile Masters BD",
        "description": "Mobile Masters BD is a leading mobile app development company that specializes in creating mobile solutions that are scalable and user-friendly.",
        "contactEmail": "jobs@mobilemastersbd.com",
        "contactPhone": "+880-31-9876543"
      }
    }
  ]
}